RT-Thread/rt-thread/bsp/freescale/platform/system/src/clock/MK66F18/fsl_clock_MK66F18.c
    switch(src)
    {
        case kClockTpmSrcPllFllSelDiv:   /* FLL/PLL */
            freq = CLOCK_SYS_GetPllFllDivClockFreq();
            break;
        case kClockTpmSrcOsc0erClk:  /* OSCERCLK */
            freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
            break;
        case kClockTpmSrcMcgIrClk:   /* MCGIRCLK. */
            freq = CLOCK_HAL_GetInternalRefClk(MCG);
            break;
        default:
            freq = 0U;
            break;
    }
    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetTpmExternalFreq
 * Description   : Gets the external clock frequency for TPM module.
 * This function gets the external clock frequency for TPM moudle.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetTpmExternalFreq(uint32_t instance)
{
    sim_tpm_clk_sel_t src = CLOCK_SYS_GetTpmExternalSrc(instance);

    if (kSimTpmClkSel0 == src)
    {
        return g_tpmClkFreq[0];
    }
    else
    {
        return g_tpmClkFreq[1];
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetLpuartFreq
 * Description   : Gets the clock frequency for LPUART module.
 * This function gets the clock frequency for LPUART moudle.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetLpuartFreq(uint32_t instance)
{
    clock_lpuart_src_t src;
    uint32_t freq;

    src = CLOCK_HAL_GetLpuartSrc(SIM, instance);
    switch (src)
    {
        case kClockLpuartSrcPllFllSel:
            freq = CLOCK_SYS_GetPllFllDivClockFreq();
            break;
        case kClockLpuartSrcOsc0erClk:
            freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
            break;
        case kClockLpuartSrcMcgIrClk:
            freq = CLOCK_HAL_GetInternalRefClk(MCG);
            break;
        default:
            freq = 0U;
            break;
    }
    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetEnetRmiiFreq
 * Description   : Gets the clock frequency for ENET module RMII clock.
 * This function gets the clock frequency for ENET moudle RMII clock.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetEnetRmiiFreq(uint32_t instance)
{
    /* get the sim clock source setting*/
    if (CLOCK_HAL_GetRmiiSrc(SIM, instance) == kClockRmiiSrcExtalClk)
    {
        return CLOCK_SYS_GetOsc0ExternalRefClockFreq();   /* OSCERCLK */
    }
    else
    {
        return g_enet1588ClkInFreq[0];      /* ENET_1588_CLKIN */
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetEnetTimeStampFreq
 * Description   : Gets the clock frequency for ENET module TIME clock.
 * This function gets the clock frequency for ENET moudle TIME clock.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetEnetTimeStampFreq(uint32_t instance)
{
    uint32_t freq;
    clock_time_src_t src;

    src = CLOCK_HAL_GetTimeSrc(SIM, instance);

    switch(src)
    {
        case kClockTimeSrcCoreSysClk: /* Core/System clock. */
            freq = CLOCK_SYS_GetCoreClockFreq();
            break;
        case kClockTimeSrcPllFllSel:  /* FLL/PLL/IRC48M. */
            freq = CLOCK_SYS_GetPllFllClockFreq();
            break;
        case kClockTimeSrcOsc0erClk:   /* OSCERCLK. */
            freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
            break;
        case kClockTimeSrcExt:        /* ENET 1588 clock in. */
            freq = g_enet1588ClkInFreq[0];
            break;
        default:
            freq = 0U;
            break;
    }
    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetUsbfFreq
 * Description   : Gets the clock frequency for USB FS OTG module.
 * This function gets the clock frequency for USB FS OTG moudle.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetUsbfsFreq(uint32_t instance)
{
    uint8_t usbdiv, usbfrac;
    uint32_t freq;
    clock_usbfs_src_t src;

    src = CLOCK_HAL_GetUsbfsSrc(SIM, instance);

    if (kClockUsbfsSrcExt == src)
    {
        return g_usbClkInFreq[0];       /* USB_CLKIN */
    }
    else
    {
        freq = CLOCK_SYS_GetPllFllClockFreq();

        CLOCK_HAL_GetUsbfsDiv(SIM, &usbdiv, &usbfrac);
        return freq * (usbfrac + 1) / (usbdiv + 1);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetUsbhsSlowClockFreq
 * Description   : Gets the slow clock frequency for USB HS/USB PHY module.
 * This function gets the clock frequency for USB HS/USB PHY module,
 * used to detect wakeup and resume events.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetUsbhsSlowClockFreq(uint32_t instance) {

  if (CLOCK_HAL_GetUsbhsSlowClockSrc(SIM, instance) == kClockUsbhsSlowClkSrcMcgIrClk)
    {
        return CLOCK_SYS_GetInternalRefClockFreq();       /* MCGIRCLK */
    }
    else
    {
        return CLOCK_SYS_GetRtcFreq(0U);                  /* RTC 32.768kHz clock */
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetFlexcanFreq
 * Description   : Gets FLEXCAN clock frequency.
 * This function gets the FLEXCAN clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetFlexcanFreq(uint32_t instance, clock_flexcan_src_t flexcanSrc)
{
    if (kClockFlexcanSrcOsc0erClk == flexcanSrc)
    {
        return CLOCK_SYS_GetOsc0ExternalRefClockFreq();
    }
    else
    {
        return CLOCK_SYS_GetBusClockFreq();
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetUartFreq
 * Description   : Gets the clock frequency for UART module.
 * This function gets the clock frequency for UART moudle.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetUartFreq(uint32_t instance)
{
    uint32_t freq;

